Revit 2024 API
BendingDetailCustomFieldProperties.SegmentLengthDimensionsEnabled Property
 Identifies if any segment length dimensions will be shown or not.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public bool SegmentLengthDimensionsEnabled { get; set; }
Visual Basic
Public Property SegmentLengthDimensionsEnabled As Boolean
	Get
	Set
Visual C++
public:
property bool SegmentLengthDimensionsEnabled {
	bool get ();
	void set (bool value);
}
See Also
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace